Added `CachedDag`.
